app/controllers/users_controller.rb

INSERT INTO "users" ("phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["phone", "4848594033"], ["password", "384985908"], ["created_at", "2022-10-29 16:15:05.510592"], ["updated_at", "2022-10-29 16:15:05.510592"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 1]]
---
  def show
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 9]]
---
  def edit
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 12]]
UPDATE "users" SET "name" = ?, "gender" = ?, "sexuality" = ?, "birthday" = ?, "location" = ?, "education" = ?, "career" = ?, "height" = ?, "profile_photo" = ?, "updated_at" = ? WHERE "users"."uid" = ?
---
  def update
    # we receive all fields in params[:user]
    # # update the model
    # if successful, redirect to user page
    @user = User.find(params[:id])
    # @user = User.new(user_params)

    if @user.update(user_params)